export const urlSrc = 'https://localhost:44344';
export const adminRole = "ADMIN";
export const sellerRole = "SELLER";
export const accept = "accept";
export const reject = "reject";

export const statusAccept = "ACCEPTED";
export const statusReject = "REJECTED";

export let header = [
    {
        title: 'Вход',
        link: '/login',
    },
    {
        title: 'Регистрация',
        link: 'signin',
    },
    {
        title: 'Разместить коллектив и конкурс',
        link: '/statement',
    }
];

export let navMenuButton = [
    {
        title: 'Коллективы',
        link: '/'
    },
    {
        title: 'Конкурсы',
        link: '/competitions'
    }
];

export let tabletitle  = ['Логин', 'ФИО', 'Почта','Телефон','Подробнее','Удалить'];
export let tableUsersImg = [
    {
        src: '/icons/podrobnee.svg',
        alt: 'Подробнее',
    },

    {
        src: '/icons/edit.svg',
        alt: 'Изменить',
    },

    {
        src: '/icons/del.svg',
        alt: 'Удалить',
    }
];

export let footerList = [
    {
        title: 'Разместить коллектив',
        link: '/statement'
    },
    {
        title: 'Разместить конкурс',
        link: '/statement'
    },
    {
        title: 'Конкурсы' ,
        link: '/competitions'
    },
    {
        title: 'Коллективы',
        link: '/'
    },
    {
        title: 'Атрибутика',
        link: '/attributes'
    },
    {
        title: 'Услуги',
        link: '/services'
    }
];

export let socials = [
    {
        src: '/icons/youtube.svg',
        alt: 'Youtube',
        link: 'https://www.youtube.com/'
    },

    {
        src: '/icons/telega.svg',
        alt: 'Telegram',
        link: 'https://web.telegram.org/'
    },

    {
        src: '/icons/inst.svg',
        alt: 'Instagram',
        link: 'https://www.instagram.com/'
    },
    {
        src: '/icons/vk.svg',
        alt: 'Vk',
        link: 'https://vk.com/',
    }
];
export let tableItems = ['Название', 'Дата / Размер', 'Цена','Количество', 'Стоимость'];
export let tableOrders = ['№','Заказчик', 'Статус', 'Дата заказа', 'Дата прибытия', 'Адрес', 'Оплата', 'Детали заказа']
export let detailOrders = ['Заказчик','Телефон', 'Почта', 'Статус', 'Дата заказа', 'Дата прибытия', 'Адрес', 'Оплата']
export let tableAtribut  = ['№', 'Продавец','Название','Цена', 'Изменить', 'Удалить'];
export let tableService  = ['№', 'Продавец','Название','Цена', 'Изменить', 'Удалить'];
export let inputTitleAtribut  = ['Продавец','Название', 'Категория', 'Цена', 'Размеры:'];
export let inputTitleService  = ['Продавец','Название', 'Категория','Цена', 'Даты:'];
export let inputTitle = ['№','Привилегии', 'Фамилия', 'Имя', 'Отчество', 'Логин', 'Почта', "Телефон"]
export let roles = [
    {
        idRole: "ADMIN",
        name: 'Администратор'
    },
    {
        idRole: "CLIENT",
        name: 'Клиент'
    },
    {
        idRole: "DIRECTOR",
        name: 'Руководитель коллектива'
    },
    {
        idRole: "ORGANIZER",
        name: 'Организатор конкурсов'
    },
    {
        idRole: "SELLER",
        name: 'Продавец'
    }
];

export const listClientWindow = [
    {
        title: 'Moи заявки',
        link: '/mystatements'
    },
    {
        title: 'Заказы',
        link: '/orders'
    },
];
export const listDirectorWindow = [
    {
        title: 'Moи коллективы',
        link: '/mygroups'
    },
    {
        title: 'Moи заявки',
        link: '/mystatements'
    },
    {
        title: 'Заказы',
        link: '/orders'
    },
];


export const listOrganizerWindow = [
    {
        title: 'Moи конкурсы',
        link: '/mycompetitions'
    },
    {
        title: 'Moи заявки',
        link: '/mystatements'
    },
    {
        title: 'Заказы',
        link: '/orders'
    },
]

export const listAdminWindow = [
    {
        title: 'Пользователи',
        link: '/users'
    },
    {
        title: 'Заявки о размещении',
        link: '/statements'
    },
    {
        title: 'Заказы',
        link: '/allorders'
    },
    {
        title: 'Атрибутика',
        link: '/products/attributes'
    },
    {
        title: 'Услуги',
        link: '/products/services'
    },
];

export const listSellerWindow = [
    {
        title: 'Мои услуги',
        link: '/myproducts/services'
    },
    {
        title: 'Моя атрибутика',
        link: '/myproducts/attributes'
    },
    {
        title: 'Заказанные атрибутика и услуги',
        link: '/myorders'
    }
];

export const atributsCategory = [
    {
        title: "Аксессуары",
        category: "ACCESSORIES"
    },
    {
        title: "Косметика",
        category: "COSMETICS"
    },
    {
        title: "Обувь",
        category: "SHOES"
    },
    {
        title: "Верх",
        category: "UPPER_CLOTHING"
    },
    {
        title: "Низ",
        category: "LOWER_CLOTHING"
    }];

export const servicesCategory = [
    {
        title: "Макияж",
        category: "MAKEUP"
    },
    {
        title: "Печать",
        category: "PRINT"
    },
    {
        title: "Пошив",
        category: "SEWING"
    },
    {
        title: "Прически",
        category: "HAIRSTYLES"
    }];

export const OrderStatus = ["CREATE", "SENT", "DELIVERED", "CANCELLED"];
export const OrderStatusSeller = ["CREATE", "SENT", "DELIVERED"];
export const PaymentStatus = ["PAID", "NOT_PAID"];

export const groupForm = ['Название:', 'Стиль:', 'Город:', 'Адрес:', 'Описание:'];
export const competitionForm = ['Название', 'Дата начала', 'Дата окончания', 'Город', 'О конкурсе'];
export const participantTitle = ['Название','Адрес', 'Руководитель', 'Телефон', 'Email'];
export const statementGroup = ['Название:', 'Город:', 'Адрес:', 'Описание:'];
export const tablestatement = ['№','Пользователь', 'Тип', 'Название', 'Город', 'Подробнее', 'Принять', 'Отклонить' ];
export const detailGroup = ['Пользователь', 'Почта', 'Тип', 'Название', 'Город', 'Адрес'];
export const detailCompetition = ['Пользователь', 'Почта', 'Тип', 'Название', 'Город', 'Дата начала', 'Дата окончания'];

export const City = [
"Абакан",
"Абинск",
"Адлер",
"Азов",
"Аксай",
"Александров",
"Альметьевск",
"Анапа",
"Ангарск",
"Апатиты",
"Апрелевка",
"Арзамас",
"Армавир",
"Архангельск",
"Астрахань",
"Ачинск",
"Балаково",
"Балашиха",
"Балтийск",
"Барабинск",
"Барнаул",
"Батайск",
"Белгород",
"Белогорск",
"Бердск",
"Березники",
"Благовещенск",
"Братск",
"Бронницы",
'Брянск',
"Бугульма",
"Бузулук",
"Великие Луки",
"Великий Новгород",
"Вельск",
"Верхняя Пышма",
"Видное",
"Владивосток",
"Владикавказ",
"Владимир",
"Внуково",
"Волгоград",
"Волгодонск",
"Волжский (Волгоградская обл.)",
"Вологда",
"Волоколамск",
"Волхов",
"Воркута",
"Воронеж",
"Воскресенск",
"Воткинск",
"Всеволожск",
"Выборг",
"Вышний Волочек",
"Вязьма",
"Гатчина",
"Геленджик",
"Георгиевск",
"Глазов",
"Голицыно",
"Голубое",
"Горно-Алтайск",
"Горячий Ключ",
"Грозный",
"Губкин",
"Губкинский",
"Дедовск",
"Дзержинск",
"Дзержинский",
"Димитровград",
"Дмитров",
"Долгопрудный",
"Домодедово",
"Дрезна",
"Дубна",
"Егорьевск",
"Ейск",
"Екатеринбург",
"Елабуга",
"Ессентуки",
"Железногорск (Красноярский край)",
"Железногорск (Курская обл.)",
"Железнодорожный",
"Жуковский",
"Заречный",
"Звенигород",
"Зеленогорск",
"Зеленоград",
"Зеленодольск",
"Зеленокумск",
"Златоуст",
"Иваново",
"Ивантеевка",
"Ижевск",
"Иркутск",
"Истра",
"Ишимбай",
"Йошкар-Ола",
"Казань",
"Калининград",
"Калуга",
"Каменск-Уральский",
"Каменск-Шахтинский",
"Камышин",
"Канск",
"Кашира",
"Кемерово",
"Кингисепп",
"Кинешма",
"Кириши",
"Киров",
"Кировск",
"Кисловодск",
"Климовск",
"Клин",
"Ковров",
"Когалым",
"Коломна",
"Колпино",
"Коммунарка",
"Комсомольск-на-Амуре",
"Конаково",
"Копейск",
"Кореновск",
"Королев",
"Корсаков",
"Костомукша",
"Кострома",
"Котельники",
"Котлас",
"Красногорск",
"Краснодар",
"Красное Село",
"Краснокамск",
"Краснообск",
"Красноярск",
"Красный Бор",
"Кронштадт",
"Кропоткин",
"Крымск",
"Кстово",
"Кубинка",
"Кувандык",
"Кудрово",
"Куйбышев",
"Курган",
"Куровское",
"Курск",
"Лабытнанги",
"Лазаревское",
"Лангепас",
"Лениногорск",
"Ленинск-Кузнецкий",
"Ликино-Дулёво",
"Липецк",
"Лобня",
"Ломоносов",
"Лосино-Петровский",
"Луга",
"Лыткарино",
"Люберцы",
"Лянтор",
"Магадан",
"Магнитогорск",
"Майкоп",
"Махачкала",
"Мегион",
"Металлострой",
"Миасс",
"Минеральные Воды",
"Мирный",
"Мисайлово",
"Михайловск",
"Мичуринск",
"Можайск",
"Монино",
"Москва",
"Московский",
"Муравленко",
"Мурино",
"Мурманск",
"Муром",
"Мытищи",
"Набережные Челны",
"Надым",
"Наро-Фоминск",
"Нарьян-Мар",
"Нахабино",
"Находка",
"Невинномысск",
"Нефтекамск",
"Нефтеюганск",
"Нижневартовск",
"Нижнекамск",
"Нижний Новгород",
"Нижний Тагил",
"Никольское",
"Новоалтайск",
"Новокузнецк",
"Новокуйбышевск",
"Новомосковск",
"Новороссийск",
"Новосибирск",
"Новоуральск",
"Новочебоксарск",
"Новочеркасск",
"Новый Уренгой",
"Ногинск",
"Норильск",
"Ноябрьск",
"Нягань",
"Обнинск",
"Одинцово",
"Октябрьский",
"Омск",
"Орёл",
"Оренбург",
"Орехово-Зуево",
"Орск",
"Отрадное",
"Павловск",
"Павловский Посад",
"Парголово",
"Пенза",
"Первоуральск",
"Переславль-Залесский",
"Пермь",
"Петергоф",
"Петрозаводск",
"Петропавловск-Камчатский",
"Печора",
"Плесецк",
"Подольск",
"Полевской",
"Прокопьевск",
"Псков",
"Пушкин",
"Пушкино",
"Пятигорск",
"Радужный",
"Раменское",
"Рассказовка",
"Реутов",
"Ржев",
"Ростов-на-Дону",
"Руза",
"Рыбинск",
"Рязань",
"Салават",
"Салехард",
"Самара",
"Санкт-Петербург",
"Саранск",
"Сарапул",
"Саратов",
"Саров",
"Сафоново",
"Свердловский",
"Северодвинск",
"Северск",
"Сергиев Посад",
"Серпухов",
"Сертолово",
"Сестрорецк",
"Сколково",
"Славянка",
"Славянск-на-Кубани",
"Сланцы",
"Смоленск",
"Соликамск",
"Солнечногорск",
"Соль-Илецк",
"Сосновый Бор",
"Сосногорск",
"Софрино",
"Сочи",
"Ставрополь",
"Старая Купавна",
"Старый Оскол",
"Стерлитамак",
"Стрежевой",
"Ступино",
"Сургут",
"Сызрань",
"Сыктывкар",
"Таганрог",
"Тамбов",
"Тарко-Сале",
"Тверь",
"Тихвин",
"Тихорецк",
"Тобольск",
"Тольятти",
"Томск",
"Торжок",
"Тосно",
"Троицк",
"Туапсе",
"Туймазы",
"Тула",
"Тюмень",
"Улан-Удэ",
"Ульяновка",
"Ульяновск",
"Урай",
"Усинск",
"Усолье-Сибирское",
"Уссурийск",
"Уфа",
"Ухта",
"Фрязино",
"Хабаровск",
"Ханты-Мансийск",
"Химки",
"Хотьково",
"Чайковский",
"Чапаевск",
"Чебоксары",
"Челябинск",
"Череповец",
"Чехов",
"Чита",
"Шатура",
"Шахты",
"Шлиссельбург",
"Шушары",
"Щелково",
"Щербинка",
"Электросталь",
"Электроугли",
"Энгельс",
"Югорск",
"Южно-Сахалинск",
"Яблоновский",
"Якутск"
];